'''1. Наибольший общий делитель
В модуле math есть функция math.gcd(a, b), возвращающая наибольший общий делитель (НОД) двух чисел. Вычислите и напечатайте наибольший общий делитель для списка натуральных чисел. Ввод чисел продолжается до ввода пустой строки.
Входные данные Выходные данные
36 6
12
144
18
Орел и решка
Дана строка текста, состоящая из букв русского алфавита "О" и "Р". Буква "О" – соответствует выпадению Орла, а буква "Р" – соответствует выпадению Решки. Напишите программу, которая подсчитывает наибольшее количество подряд выпавших Решек.
Формат входных данных:
На вход программе подается строка текста, состоящая из букв русского алфавита "О" и "Р".
Формат выходных данных:
Программа должна вывести наибольшее количество подряд выпавших Решек.
Примечание. Если выпавших Решек нет, то необходимо вывести число 0.
Входные данные Выходные данные
ОРРОРОРООРРРО 3
ООООООРРРОРОРРРРРРР 7
ООООРРРРОРОРРРРРРРРООРОРОРРРРРРРРРРРРРРРРРРРРРРРРРРРРРРР '''

